Repository: gauravsaxenais/SampleApp
Catalog: SampleAppApi/Dev/MircomApi.Resources/SharedResources.*.resx
Languages: fr_ca

# Login_InCorrectUserNamePassword
source: Username or password is incorrect.
fr_ca: L'identifiant ou le mot de passe est incorrect

# Login_NullModel
source: The Login model is null.
fr_ca: Le modèle de connexion est nul.

# Login_RequiredPassword
source: The Password field is required.
fr_ca: Le champ Mot de passe est obligatoire.

# Login_RequiredUserName
source: The Username field is required.
fr_ca: Le champ Nom d'utilisateur est obligatoire.

# Login_ValidUserName
source: Username is valid:
fr_ca: Le nom d'utilisateur est valide:

# Site_DuplicateSitesIssue
source: Site name should be unique in site list.
fr_ca: Le nom du site doit être unique dans la liste de sites.

# Site_InternalIssue
source: There was an internal issue updating the sites.
fr_ca: Un problème interne est survenu lors de la mise à jour des sites.

# Site_InvalidSiteId
source: Site id should be greater than 0.
fr_ca: L'identifiant du site doit être supérieur à 0.

# Site_IssueDatabaseSites
source: There was an issue retrieving the site/sites.
fr_ca: Un problème est survenu lors de la récupération des sites.

# Site_IssueDatabaseTemplates
source: There was an issue retrieving the list of templates.
fr_ca: Un problème est survenu lors de l'extraction de la liste des modèles.

# Site_IssueUpload
source: There is an issue uploading the site on server.
fr_ca: Un problème est survenu lors du téléchargement du site sur le serveur.

# Site_LargeFile
source: Please upload a file upto 5 mb.
fr_ca: S'il vous plaît télécharger un fichier jusqu'à 5 mb.

# Site_NoDataSites
source: There are no sites in the system.
fr_ca: Il n'y a pas de sites dans le système.

# Site_NoDataSitesRequest
source: There are no sites in the user request.
fr_ca: Il n'y a pas de sites dans la demande de l'utilisateur.

# Site_NoDataTemplates
source: There are no templates in the system.
fr_ca: Il n'y a pas de modèles dans le système.

# Site_SuccessfulUpdate
source: Site list is successfully updated.
fr_ca: La liste de sites est mise à jour avec succès.

# Site_SuccessUpload
source: Site is successfully uploaded in server.
fr_ca: Le site a été téléchargé avec succès sur le serveur.

# Site_ValidBase64EncodedData
source: Please upload valid base64 encoded string.
fr_ca: Veuillez télécharger une chaîne encodée en base64 valide.

# System_NoDetails
source: There are no system details in database against siteId.
fr_ca: Il n'y a pas de détails système dans la base de données contre siteId.

# System_NoPanelDetails
source: There are no panel details in database against panelGuid.
fr_ca: Il n'y a pas de détails sur les panneaux dans la base de données contre panelGuid.

# Dashboard_FailedExecution
source: The execution of the widget operation failed.
fr_ca: L'exécution de l'opération du widget a échoué.

# Dashboard_NoDetails
source: There is no dashboard data in database against siteId.
fr_ca: Il n'y a pas de données de tableau de bord dans la base de données par rapport à siteId.

# Event_NoData
source: There are no events in the system.
fr_ca: Il n'y a pas d'événements dans le système.

# Dashboard_InvalidData
source: The Dashboard data provided is empty.
fr_ca: Les données de tableau de bord fournies sont vides.

# Dashboard_InvalidGuid
source: The widget Guid is not valid.
fr_ca: Le widget Guid n'est pas valide.

# Status_InvalidSiteBuildingId
source: The Site or Building information provided is not valid.
fr_ca: Les informations sur le site ou le bâtiment fournies ne sont pas valides.

# Status_InvalidSiteMapGuid
source: The Site and Map information is not valid.
fr_ca: Les informations de site et de carte ne sont pas valides.

# Status_NoData
source: There is no information in system against Site Id and Building Id.
fr_ca: Il n'y a aucune information dans le système par rapport à l'identifiant de site et à l'identifiant de bâtiment.

# Status_NoStatusInformation
source: There is no status information in system.
fr_ca: Il n'y a pas d'informations d'état dans le système.

# Chart_InvalidRequest
source: Chart request data is not valid.
fr_ca: Les données de demande de graphique ne sont pas valides.

# Chart_NoChartData
source: There is no chart data in system.
fr_ca: Il n'y a pas de données de graphique dans le système.

# Map_EmptyFloorMap
source: The floor map information is empty.
fr_ca: Les informations de la carte d'étage sont vides.

# Map_InvalidBuildingUpdate
source: There is an issue updating the list of buildings.
fr_ca: Un problème est survenu lors de la mise à jour de la liste des bâtiments.

# Map_InvalidImageExtension
source: Please upload image of type .jpg,.gif and .png.
fr_ca: Veuillez télécharger une image de type .jpg, .gif et .png.

# Map_InvalidSiteBuildingInformation
source: The Site or Building information provided is not valid.
fr_ca: Les informations sur le site ou le bâtiment fournies ne sont pas valides.

# Map_InvalidSiteType
source: The Site or type information is not valid.
fr_ca: Les informations de site ou de type ne sont pas valides.

# Map_InvalidSize
source: Please upload a file upto 5 mb.
fr_ca: S'il vous plaît télécharger un fichier jusqu'à 5 mb.

# Map_IssueUpdatingFloor
source: There is an issue updating floor map in system. Please try again later.
fr_ca: Il y a un problème de mise à jour de la carte au sol dans le système. Veuillez réessayer plus tard.

# Map_NoBuildingInformation
source: There is no building information in the system.
fr_ca: Il n'y a pas d'informations sur le bâtiment dans le système.

# Map_NoMapInformation
source: There is no map information in system.
fr_ca: Il n'y a pas d'informations cartographiques dans le système.

# Map_NoValidImage
source: Please upload a valid image.
fr_ca: S'il vous plaît télécharger une image valide.

# Camera_InvalidCameraViewInformation
source: The camera information provided is not valid.
fr_ca: Les informations fournies par la caméra ne sont pas valides.

# Camera_InvalidUpdate
source: There is an issue updating camera information. Please try again later.
fr_ca: Il y a un problème de mise à jour des informations de la caméra. Veuillez réessayer plus tard.

source: TX3 1000 LCD4
fr_ca: TX3 1000 LCD4 fr

source: TX3 1000 LCD8
fr_ca: TX3 1000 LCD8 fr

source: TX3 2000 LCD4
fr_ca: TX3 2000 LCD4 fr

source: TX3 2000 LCD8
fr_ca: TX3 2000 LCD8 fr

source: TX3 200 LCD4
fr_ca: TX3 200 LCD4 fr

source: TX3 200 LCD8
fr_ca: TX3 200 LCD8 fr

source: TX3 Assa
fr_ca: TX3 Assa fr

source: TX3 CX 1 Door
fr_ca: TX3 CX 1 Door fr

source: TX3 CX 2 Door
fr_ca: TX3 CX 2 Door fr

source: TX3 Elevator
fr_ca: TX3 Elevator fr

source: TX3 EMER 1S
fr_ca: TX3 EMER 1S fr

source: TX3 EMER 200KS
fr_ca: TX3 EMER 200KS fr

source: TX3 Nano
fr_ca: TX3 Nano fr

source: TX3 System
fr_ca: TX3 System fr

source: TX3 Touch
fr_ca: TX3 Touch fr
